public/man/man1/newgrp.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - newgrp.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - newgrp.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>newgrp - log in to a new group</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>newgrp</strong> [-] [/group/]</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>The <strong>newgrp</strong> command is used to change the current group ID during a
login session. If the optional <strong>-</strong> flag is given, the users environment
will be reinitialized as though the user had logged in, otherwise the
current environment, including current working directory, remains
unchanged.</p>
<p>
<strong>newgrp</strong> changes the current real group ID to the named group, or to the
default group listed in /etc/passwd if no group name is given. <strong>newgrp</strong>
also tries to add the group to the user groupset. If not root, the user
will be prompted for a password if she does not have a password (in
/etc/shadow if this user has an entry in the shadowed password file, or
in /etc/passwd otherwise) and the group does, or if the user is not
listed as a member and the group has a password. The user will be denied
access if the group password is empty and the user is not listed as a
member.</p>
<p>
If there is an entry for this group in /etc/gshadow, then the list of
members and the password of this group will be taken from this file,
otherwise, the entry in /etc/group is considered.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
CONFIGURATION
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following configuration variables in /etc/login.defs change the
behavior of this tool:</p>
<p>
<strong>SYSLOG_SG_ENAB</strong> (boolean)</p>
<blockquote>
<p>Enable &#34;syslog&#34; logging of <strong>sg</strong> activity.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
FILES
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>/etc/passwd</p>
<blockquote>
<p>User account information.</p>
</blockquote>
<p>
/etc/shadow</p>
<blockquote>
<p>Secure user account information.</p>
</blockquote>
<p>
/etc/group</p>
<blockquote>
<p>Group account information.</p>
</blockquote>
<p>
/etc/gshadow</p>
<blockquote>
<p>Secure group account information.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
SEE ALSO
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>*id*(1), *login*(1), *su*(1), *sg*(1), *gpasswd*(1), *group*(5),
*gshadow*(5).</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
